[
    {
        "id": 1,
        "title": "What is a full service digital marketing agency?",
        "body": "A full-service digital marketing agency offers its clients a comprehensive suite of digital marketing services. These services may include website design and development, search engine optimization (SEO), pay-per-click (PPC) advertising, social media marketing, email marketing, and content marketing."
    },
    {
        "id": 2,
        "title": "How do I choose a digital performance agency?",
        "body": "The best way to choose a digital performance agency is to look at their past work and see if it aligns with your goals. It would be best if you also asked for referrals from other businesses in your industry."
    },
    {
        "id": 3,
        "title": "How is Uplers different from other performance marketing companies?",
        "body": "As a reliable operational partner - we are inclined towards expertise and quality. With more than 10+ years of experience and having worked with more than 7000+ clients globally, we have helped agencies quantify their marketing efforts. How? With a full-fledged and dedicated workforce of over 1000+ professionals. Be it achieving scalability, business objectives, or even brand value - we have provided an edge over their competitors. Hence choosing us as your Performance Marketing agency is not a bad idea at all."
    },
    {
        "id": 4,
        "title": "What does a creative digital marketing agency do?",
        "body": "When working with a digital marketing agency, you can expect them to be able to easily carry out the project and leverage their expertise to get the job done right. They will also be able to provide you with regular updates on the project's progress and be available for any questions or concerns you may have."
    },
    {
        "id": 5,
        "title": "How much do Uplers charge for digital marketing agency services?",
        "body": "The cost of our paid media packages varies from business to business. Our hourly rates start from $25/hour to $40/hour. We also customize our pricing packages if our client has some specific prerequisites in mind."
    },
    {
        "id": 6,
        "title": "Which online marketing services are best for my business?",
        "body": "It depends on the business what online marketing services would be most effective. You need to consider several factors while choosing digital marketing services for your business. The most crucial factor is the budget. You must take into account the cost of the services and the return on investment. Besides that, keep in mind the type of business you have and the target audience."
    }

]