[
    {
        "id": 1,
        "title": "How much does programmatic advertising cost?",
        "body": "With Programmatic Advertising, CPM can vary greatly depending on many factors, such as your audience's geo, average CPM rates by industry, quality of ad space, page views, business vertical, and many others. The web ad cost shall also depend on the chosen formats and channels; for example- video ads are usually more expensive than native, and native ads will cost more than online display advertising or mobile"
    },
    {
        "id": 2,
        "title": "How long will it take to hire a programmatic expert from Dignifyd?",
        "body": "Within 48 hours of sharing your requirements, Dignifyd can shortlist the first batch of candidates from its pool of Programmatic Ad Experts. This process is comparatively easier and quicker than standard hiring methods. Hence, by following four easy steps, you will be able to hire the best within weeks, not months."
    },
    {
        "id": 3,
        "title": "How can I track my project's development or progress?",
        "body": "We use PMS tools like Teamwork and ProofHub internally. However, we are always ready to accommodate the tool your team is more comfortable with."
    },
    {
        "id": 4,
        "title": "Are real-time bidding and programmatic advertising the same?",
        "body": "Real-time Bidding only represents a part of programmatic ad buying, which is contrary to what people believe that the two terms are interchangeable."
    },
    {
        "id": 5,
        "title": " Why should I hire a programmatic expert from Dignifyd?",
        "body": "Hire dedicated Programmatic Experts from Dignifyd and unveil an efficient way of executing business operations. Our talent curators take over the legwork and give you freedom from the tedious hiring process and even post-hiring responsibilities."
    },
    {
        "id": 6,
        "title": " Do you provide a trial period for hiring a programmatic analyst?",
        "body": "Yes, our team understands what it takes to find a good fit for the job. Therefore, we provide a 14-day trial period for the candidate you shortlist."
    }
  


]