[
    {
        "id": 1,
        "title": "When can I expect to see results for my SEO Campaigns?",
        "body": "When you hire SEO specialists from NXG, we deliver promising results. SEO demands a lot of patience and is a long-term investment. Considering our experience, the results start showing up within the first 4 months of the implementation."
    },
    {
        "id": 2,
        "title": "Does NXG have its own team of local SEO specialists? Or do you sub-contract or outsource resources?",
        "body": "NXG has its own team of 100+ resources including affordable SEO Experts. We are one of the largest and most well-established agencies in the industry. All our team is in-house and on our payroll. So, no we don’t outsource."
    },
    {
        "id": 3,
        "title": "How do you match me with the right resources for my project?",
        "body": "When you hire dedicated SEO professionals from us, we will introduce you to each member of your team by sharing their profiles across an email."
    },
    {
        "id": 4,
        "title": "Are real-time bidding and programmatic advertising the same?",
        "body": "Our internal system connects you to the most appropriate resources after thoroughly assessing your project’s requirements. It is based on a combination of factors such as levels of expertise, skill sets, abilities and years of experience."
    },
    {
        "id": 5,
        "title": "Are there any costs involved when I hire SEO professionals from NXG?",
        "body": "You’d be pleased to hear that there are absolutely no costs associated with setting up a team. We don’t charge any upfront fee to set up your team. You’ll only have to pay the monthly amount as per the final agreement."
    },
    {
        "id": 6,
        "title": "Why should we hire Search Engine Optimization Experts from NXG?",
        "body": "NXG take a completely different approach. We believe in taking ownership of the work we do. We take full responsibility for your project as well as the team working on it and making sure the resource you hire gives optimum productivity. And with more than 9 years of experience working with different clients, our Search Engine Optimization Experts have never been disappointing when it comes to delivering results and meeting our clients' expectations."
    },
    {
        "id": 7,
        "title": "Do you guarantee SEO results?",
        "body": "Over the years, we have learnt that SEO is not a one-sided race to achieve rankings or results. Both the client and the service provider play an equal role. SEO depends on many factors including Domain Authority, keywords, competition for keywords, competitors, meta-data structures and so on. So, committing to any guarantee would be unwise."
    }
  


]